package leason1;

import java.util.Arrays;

public class HW2 {
//    Задать целочисленный массив, состоящий из элементов 0 и 1.
//    Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ]. С помощью цикла и условия заменить 0 на 1, 1 на 0;

}
//
//    public static void main(String[] args) {
//        int[] arr = {1, 0, 1, 0, 0, 1};
//        for (int i = 0; i < arr.length; i++) {
//            if (arr[i] == 1) {
//            }
//        }
//    }


//    public static void invertArray() {
//        int[] arr = {1, 0, 1, 0, 0, 1};
//        for (int i = 0; i < arr.length; i++) {
//            if(arr[i] == 1) {
//            arr[i] = 0;
//        } else arr[i] = 1;

//2.  Задать пустой целочисленный массив размером 8. С помощью цикла заполнить
//    его значениями 0 3 6 9 12 15 18 21;
//public static void fillArray() {
//    int[] arr = new int[8];
//    for (int i = 0; i < arr.length; i+=3) {
//        System.out.println("arr.length: " + arr.length);        }
//    }
//}
//3. Задать массив [ 1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1 ] пройти по нему циклом,
//    и числа меньшие 6 умножить на 2;
//public static void changeArray() {
//    int[] w = {1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1};
//    for (int i = 0; i < w.length; i++) {
//        if (w[i] < 6) {
//            w[i] = w[i] * 2;
//        }
//        System.out.print(i + "-" + w[i] + " ");
//            }
//        }
//    }
//}

//4.    Создать квадратный двумерный целочисленный массив (количество строк и столбцов одинаковое),
//    и с помощью цикла(-ов) заполнить его диагональные элементы единицами;
//public static void fillDiagonal() {
//    int[][] sqArr = new int[2][2];
//    System.out.println("");
//    for (int i = 0; i < 2; i++) {
//        for (j = 0; j < 2; j++) {
//            if (i < j) {
//                sqArr[i][j] = 0;
//            } else if (i > j) {
//                sqArr[i][j] = 1;
//            } else {
//                sqArr[i][j] = 1;
//            }
//            System.out.print(sqArr[i][j] + " ");
//        }
//        System.out.println();
//    }
//}
//}
// 5. ** Задать одномерный массив и найти в нем минимальный и максимальный элементы (без помощи интернета);

//public static void main(String[] args) {
//    int[] mas = {9, 7, 8, 2, 11, 4, 5, 2, 4, 8, 9, 5};
//    int min = mas[0], max = mas[0], i, imin = 0, imax = 0;
//    for(i = 0; i != mas.length; i++)
//    {
//        if(mas[i] < min){
//            min = mas[i];
//            imin = i;
//        }
//        if(mas[i] > max){
//            max = mas[i];
//            imax = i;
//        }


//        System.out.println("max = "+max+" min = "+min);
//        System.out.println("imax = "+imax+" imin = "+imin);
//    }
//}
//}
